{
  "__comment": "Configuration for browser extension that does small UI changes, like removing the 'merge pull request' button, and adding buttons for 'import to phabricator' or 'land to fbsource' - currently FB-Only, though we hope to change that",
  "allowDirectMerges": false,
  "allowBotCommands": true,
  "internalRepository": "fbsource",
  "cannedReplies": {
    "Stack Overflow": "This issue looks like a question that would be best asked on [StackOverflow](http://stackoverflow.com/questions/tagged/react-native).\n\nStackOverflow is amazing for Q&A: it has a reputation system, voting, the ability to mark a question as answered. Because of the reputation system it is likely the community will see and answer your question there. This also helps us use the GitHub bug tracker for bugs only.\n\nWill close this as this is really a question that should be asked on StackOverflow.",
    "Reject Showcase App": "Thanks for sending this pull request. For consistency the Showcase is now fully managed by the open source team at Facebook and we unfortunately cannot accept more pull requests to it. Feel free to post about the app in the React Native Community group on Facebook to increase visibility.",
    "Needs More Info": "Hey, thanks for reporting this issue!\n\nIt looks like your description is missing some necessary information. Can you please add all the details specified in the [template](https://github.com/facebook/react-native/blob/master/.github/ISSUE_TEMPLATE.md)? This is necessary for people to be able to understand and reproduce the issue being reported.\n\nI am going to close this, but feel free to open a new issue with the additional information provided. Thanks!",
    "Request RNPlay": "Can you provide a minimal amount of code to reproduce this on [rnplay.org](https://rnplay.org/)? This is necessary for people to be able to see and debug the issue being reported.\n\nClosing this issue as it is not actionable. Please open a new one with an rnplay link (preferred), or link to a GitHub repo with clear instructions how to repro.",
    "Close Inactive PR": "This pull request has been inactive for a while and the last comments are questions or there have been changes requested.\n\nI'll close the pull request so it doesn't stay open indefinitely. If you plan to continue working on this please send a new pull request.",
    "No Reply": "Closing this issue as more information is needed to debug this and we haven't heard back from the author. Once there's more information we can reopen the issue.",
    "Feature Request": "Thanks for opening the issue, however it looks like a feature request. As noted in the [Issue template](https://github.com/facebook/react-native/blob/master/.github/ISSUE_TEMPLATE.md) we'd like to use the GitHub issues to track bugs only. Can you implement the feature as a standalone npm module? If not consider sending a pull request or a create an entry on [Canny](https://reactnative.canny.io/feature-requests). It has a voting system and if the feature gets upvoted enough it might get implemented by someone from the community. Closing this now, thanks for understanding!",
    "CLA": "Thanks for sending this pull request! We would love to review your changes however it looks like you haven't signed the CLA yet. You can do so at https://code.facebook.com/cla.",
    "Icebox": "Closing this issue because it has been inactive for a while. If you think it should still be opened let us know why."
  }
}
