{
  "__comment": "Configuration for browser extension that does small UI changes, like removing the 'merge pull request' button, and adding buttons for 'import to phabricator' or 'land to fbsource' - currently FB-Only, though we hope to change that",
  "allowDirectMerges": false,
  "allowBotCommands": true,
  "internalRepository": "fbsource",
  "cannedReplies": {
    "Stack Overflow": "This issue looks like a question that would be best asked on [StackOverflow](http://stackoverflow.com/questions/tagged/react-native).\n\nStackOverflow is amazing for Q&A: it has a reputation system, voting, the ability to mark a question as answered. Because of the reputation system it is likely the community will see and answer your question there. This also helps us use the GitHub bug tracker for bugs only.\n\nWill close this as this is really a question that should be asked on StackOverflow.",
    "Reject Showcase App": "Thanks for sending this pull request. For consistency the Showcase is now fully managed by the open source team at Facebook and we unfortunately cannot accept more pull requests to it. Feel free to post about the app in the React Native Community group on Facebook to increase visibility.",
    "Needs More Info": "Hey, thanks for reporting this issue!\n\nIt looks like your description is missing some necessary information, or the list of reproduction steps is not complete. Can you please add all the details specified in the [template](https://github.com/facebook/react-native/blob/master/.github/ISSUE_TEMPLATE.md)? This is necessary for people to be able to understand and reproduce the issue being reported.\n\nI am going to close this, but feel free to open a new issue with the additional information provided. Thanks!",
    "Request Snack": "Can you reproduce the issue using [Snack](http://snack.expo.io)? This step is necessary for people to be able to see and debug the issue being reported.",
    "Close Inactive PR": "This pull request has been inactive for a while and the last comments are questions or there have been changes requested.\n\nI'll close the pull request so it doesn't stay open indefinitely. If you plan to continue working on this please send a new pull request.",
    "No Reply": "Closing this issue as more information is needed to debug this and we haven't heard back from the author. Once there's more information we can reopen the issue.",
    "Feature Request": "Thanks for opening the issue! As it happens, we're using GitHub to track bugs in React Native. If you'd like to submit this as a feature request, please go ahead and create an entry on [Canny](https://reactnative.canny.io/feature-requests). It has a voting system and if the feature gets a good amount of votes, it will have a greater chance of being implemented by the community. Closing this now, thanks for understanding!",
    "CLA": "Thanks for sending this pull request! We would love to review your changes however it looks like you haven't signed the CLA yet. You can do so at https://code.facebook.com/cla.",
    "Close Inactive Issue": "This issue has been inactive for a while. It's possible that the bug has been fixed since this issue was originally submitted, or perhaps it is not affecting a great amount of people, or a workaround has been provided. Either way, we're going to close this in order to allow the community to focus on more pressing issues.\n\nIf you strongly believe this issue should remain open, please provide a justification below.",
    "No Repro": "Thanks for opening the issue! It does not appear like a community member will be able to reliably reproduce this issue. This may be for several reasons; perhaps it affects a particular app but a minimal repro has not been provided, or the issue may be sporadic. As it happens, we need a concrete set of steps that can demonstrably reproduce the issue as this will allow your fellow community members to validate a fix. We'll close the issue for now, but feel free to submit a new issue once you're able to reliably reproduce the issue locally. Thanks for your understanding!"
  }
}
